Revit 2027 API
BuiltInFailures.StairRampFailures.StairsStartHigherThanEnd Property
 The stairs' base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsStartHigherThanEnd { get; }
Public Shared ReadOnly Property StairsStartHigherThanEnd As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsStartHigherThanEnd {
	FailureDefinitionId^ get ();
}
static member StairsStartHigherThanEnd : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace